app/controllers/comments_controller.rb

    def create
        @post = Post.find(params[:post_id])
        @comment = @post.comments.create(params[:comment])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES ('Adam', 'Party yeah!', 1, '2011-06-06 00:59:10.014666', '2011-06-06 00:59:10.014666')

    def destroy
        @post = Post.find(params[:post_id])
        @comment = @post.comments.find(params[:id])
        @comment.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 1 AND ("comments".post_id = 1) LIMIT 1
DELETE FROM "comments" WHERE "comments"."id" = 1