app/controllers/posts_controller.rb

  def front
    @posts = Post.all.reverse[0,3]
---
SELECT "posts".* FROM "posts"

  def edit
    authorize! :edit, @post
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1

  def create
    authorize! :create, @post
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "title", "content", "created_at", "updated_at") VALUES ('Adam Pah', 'Sitting With a Pretty Lady', 'It''s just a party every day', '2011-06-06 00:42:51.246932', '2011-06-06 00:42:51.246932')

  def update
    authorize! :update, @article
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
UPDATE "posts" SET "content" = 'testy testy testy tesy testy testy testy tesy